#include <iostream>
using namespace std;

//@file    : 01 一维数组的定义
//@author  : xds
//@date    : 2025/7/23 16:39:33
//@brief   : 

int main()
{
	// 数组

	/*
	1. 数据类型  数组名[数组长度];
	2. 数据类型  数组名[数组长度] = { 值1，值2 ... };
	3. 数据类型  数组名[] = { 值1，值2 ... };
	*/

	// 1. 数据类型  数组名[数组长度];
	int arr[5];
	// 给数组的元素赋值
	// 数组元素下标从0开始索引
	arr[0] = 10;
	arr[1] = 20;
	arr[2] = 30;
	arr[3] = 40;
	arr[4] = 50;

	// 访问数组的元素
	cout << arr[0] << endl;


	// 2. 数据类型  数组名[数组长度] = { 值1，值2 ... };
	int arr2[5] = { 10, 20, 30 };  // 如果在初始化数据时没有全部初始，会用0初始化剩余元素
	cout << arr2[1] << endl;
	// 利用循环输出数组中的元素
	for (int i = 2; i < 5; i++)
	{
		cout << arr2[i] << endl;
	}

	// 3. 数据类型  数组名[] = { 值1，值2 ... };
	// 定义数组时，必须有初始长度或像这种方法暗示数组长度
	int arr3[] = { 90, 80, 70 ,60, 50, 40 };
	for (int i = 0; i < 6; i++)
	{
		cout << arr3[i] << endl;
	}

	system("pause");
	return 0;
}